In [105]:
import pandas as pd

# Read File to DataFrame
A **Data frame** is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns.

by default, pandas support csv format

In [106]:
df = pd.read_csv('data/friend_list.csv')

In [107]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

you can read txt file like below, if the txt file data are comma separated

In [108]:
df = pd.read_csv('data/friend_list.txt')

In [109]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

if txt file delimiter is not comma, you can use define delimiter using keyword argument

In [110]:
df = pd.read_csv('data/friend_list_tab.txt', delimiter = "\t")

In [111]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

if data file doesn't have header,  
Use header = None like below, so first column not to be your column header

In [112]:
df = pd.read_csv('data/friend_list_no_head.csv', header = None)

In [113]:
df.head()

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager

you can add column header after you create dataframe

In [114]:
df.columns = ['name', 'age', 'job']

In [115]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

you can create column header for no header data at once

In [116]:
df = pd.read_csv('data/friend_list_no_head.csv', header = None, names=['name', 'age', 'job'])

In [117]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

# Create DataFrame
when you want to create dataframe from your python code

## from dictionary

In [118]:
friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list)

In [119]:
df.head()

   age        job   name
0   20    student   Jone
1   30  developer  Jenny
2   30    teacher   Nate

if you need fixed column order, you can adjust column order like below,

In [120]:
df = df[['name', 'age', 'job']]

In [121]:
df.head()

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

## from OrderedDict
OrderedDict helps you to have fixed column order at once

In [122]:
from collections import OrderedDict

In [123]:
friend_ordered_dict = OrderedDict([ ('name', ['John', 'Jenny', 'Nate']),
          ('age', [20, 30, 30]),
          ('job', ['student', 'developer', 'teacher']) ] )
df = pd.DataFrame.from_dict(friend_ordered_dict)

In [124]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

## from list

In [125]:
friend_list = [ ['John', 20, 'student'],['Jenny', 30, 'developer'],['Nate', 30, 'teacher'] ]
column_name = ['name', 'age', 'job']
df = pd.DataFrame.from_records(friend_list, columns=column_name)

In [126]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [127]:
friend_list = [ 
                ['name',['John', 'Jenny', 'Nate']],
                ['age',[20,30,30]],
                ['job',['student', 'developer', 'teacher']] 
              ]
df = pd.DataFrame.from_items(friend_list)

In [128]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

# Write DataFrame to File

here is one dataframe example with header

In [129]:
friend_list = [ 
                ['name',['John', 'Jenny', 'nate']],
                ['age',[20,30,30]],
                ['job',['student', 'developer', 'teacher']] 
              ]
df = pd.DataFrame.from_items(friend_list)

In [130]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   nate   30    teacher

you can create csv file using below command,

In [131]:
df.to_csv('friend_list_from_df.csv')

below is one example of dataframe **doesn't** have header

In [132]:
friend_list = [ ['John', 20, 'student'],['Jenny', 30, 'developer'],['Nate', 30, 'teacher'] ]
df = pd.DataFrame.from_records(friend_list)

In [133]:
df.head()

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

you can write csv file using below command,

In [134]:
df.to_csv('friend_list_from_df.csv')

you also can write txt file using same command

In [135]:
df.to_csv('friend_list_from_df.txt')

by default, header and index are True like below, even if you don't mention it in the command

In [136]:
df.to_csv('friend_list_from_df.csv', header = True, index = True)

**header = False** means you don't want to create column names. no 0,1,2 at column name   
**index = False** means you don't want to create row names.  no 0,1,2 at row name

In [137]:
df.to_csv('friend_list_from_df.csv', header = False, index = False)

you can specify add column names by giving **header** with list

In [138]:
df.to_csv('friend_list_from_df.csv', header = ['name', 'age', 'job'])

below is dataframe has **None** value

In [139]:
friend_list = [ 
                ['name',['John', None, 'nate']],
                ['age',[20,None,30]],
                ['job',['student', 'developer', 'teacher']] 
              ]
df = pd.DataFrame.from_items(friend_list)

In [140]:
df.head()

   name   age        job
0  John  20.0    student
1  None   NaN  developer
2  nate  30.0    teacher

In [141]:
df.to_csv('friend_list_from_df.csv')

**na_rep** replace **None** with provided value

In [142]:
df.to_csv('friend_list_from_df.csv', na_rep = '-')

# Select Row

## by index

In [143]:
friend_list = [ 
                ['name',['John', 'Jenny', 'Nate']],
                ['age',[20,30,30]],
                ['job',['student', 'developer', 'teacher']] 
              ]
df = pd.DataFrame.from_items(friend_list)

In [144]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

select rows from index 1 to index 2

In [145]:
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

select row index 0 and index 2

In [146]:
df.loc[[0,2]]

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [147]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

## by column condition

In [148]:
df_filtered = df[df.age > 25]

In [149]:
df_filtered

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [150]:
df_filtered = df.query('age>25')

In [151]:
df_filtered

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [152]:
df_filtered = df[(df.age >25) & (df.name == 'Nate')]

In [153]:
df_filtered

   name  age      job
2  Nate   30  teacher

In [154]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

# Filter Column

## by index

In [155]:
friend_list = [ ['John', 20, 'student'],['Jenny', 30, 'developer'],['Nate', 30, 'teacher'] ]
df = pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

select all rows, from column 0 to column 1

In [156]:
df.iloc[:, 0:2]

       0   1
0   John  20
1  Jenny  30
2   Nate  30

select all rows, column 0 and column 2

In [157]:
df.iloc[:,[0,2]]

       0          2
0   John    student
1  Jenny  developer
2   Nate    teacher

In [158]:
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

## by column name

In [159]:
# you can create column header for no header data at once
df = pd.read_csv('data/friend_list_no_head.csv', header = None, names=['name', 'age', 'job'])
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [160]:
df_filtered = df[['name', 'age']]
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [161]:
df.filter(items=['age', 'job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [162]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [163]:
# select columns containing 'a'
df.filter(like='a',axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [164]:
# select columns using regex
df.filter(regex='b$',axis=1)

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

# Drop rows

## by row name (index name)

In [165]:
friend_dict_list = [{'age': 20, 'job': 'student'},
         {'age': 30, 'job': 'developer'},
         {'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list, index = ['John', 'Jenny', 'Nate'])

In [166]:
df.head()

       age        job
John    20    student
Jenny   30  developer
Nate    30    teacher

### drop row
dropped result will be shown, but dataframe keeps the dropped row

In [167]:
df.drop(['John', 'Nate'])

       age        job
Jenny   30  developer

In [168]:
df

       age        job
John    20    student
Jenny   30  developer
Nate    30    teacher

you can assign the result to dataframe to keep the dropped result like below,

In [169]:
df = df.drop(['John', 'Nate'])

In [170]:
df

       age        job
Jenny   30  developer

### drop row in place
The dropped row will be deleted from dataframe with inplace keyword parameter

In [171]:
friend_dict_list = [{'age': 20, 'job': 'student'},
         {'age': 30, 'job': 'developer'},
         {'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list, index = ['John', 'Jenny', 'Nate'])

In [172]:
df.drop(['John', 'Nate'], inplace = True)

In [173]:
df

       age        job
Jenny   30  developer

## by row id (index number)

In [174]:
friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list)

In [175]:
df

   age        job   name
0   20    student   Jone
1   30  developer  Jenny
2   30    teacher   Nate

you can drop rows by its index

In [176]:
df = df.drop(df.index[[0,2]])

In [177]:
df

   age        job   name
1   30  developer  Jenny

## By Column value

In [178]:
friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list)
df

   age        job   name
0   20    student   Jone
1   30  developer  Jenny
2   30    teacher   Nate

In [179]:
df = df[df.age != 30]

In [180]:
df

   age      job  name
0   20  student  Jone

# Drop column

In [181]:
friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list)
df

   age        job   name
0   20    student   Jone
1   30  developer  Jenny
2   30    teacher   Nate

In [182]:
df = df.drop('age', axis=1)

In [183]:
df

         job   name
0    student   Jone
1  developer  Jenny
2    teacher   Nate

# Add Column

In [184]:
friend_dict_list = [{'name': 'Jone', 'age': 15, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'age', 'job'])
df

    name  age        job
0   Jone   15    student
1  Jenny   30  developer
2   Nate   30    teacher

### Add New Column with default value

In [185]:
df['salary'] = 0

In [186]:
df

    name  age        job  salary
0   Jone   15    student       0
1  Jenny   30  developer       0
2   Nate   30    teacher       0

### Add New Column derived from existing value

In [187]:
friend_dict_list = [{'name': 'Jone', 'age': 15, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'age', 'job'])
df

    name  age        job
0   Jone   15    student
1  Jenny   30  developer
2   Nate   30    teacher

#### one liner adding column by true or false condition

In [188]:
import numpy as np
df['salary'] = np.where(df['job'] != 'student' , 'yes', 'no')

In [189]:
df

    name  age        job salary
0   Jone   15    student     no
1  Jenny   30  developer    yes
2   Nate   30    teacher    yes

In [190]:
friend_dict_list = [{'name': 'John', 'midterm': 95, 'final': 85},
         {'name': 'Jenny', 'midterm': 85, 'final': 80},
         {'name': 'Nate', 'midterm': 10, 'final': 30}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])
df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30

#### column derived from adding two existing columns

In [191]:
df['total'] = df['midterm'] + df['final']

In [192]:
df

    name  midterm  final  total
0   John       95     85    180
1  Jenny       85     80    165
2   Nate       10     30     40

#### columm from existing column

In [193]:
df['average'] = df['total'] / 2

In [194]:
df

    name  midterm  final  total  average
0   John       95     85    180     90.0
1  Jenny       85     80    165     82.5
2   Nate       10     30     40     20.0

#### column by conditional condition

In [195]:
grades = []

for row in df['average']:
    if row >= 90:
        grades.append('A')
    elif row >= 80:
        grades.append('B')
    elif row >= 70:
        grades.append('C')
    else:
        grades.append('F')
        
df['grade'] = grades

In [196]:
df

    name  midterm  final  total  average grade
0   John       95     85    180     90.0     A
1  Jenny       85     80    165     82.5     B
2   Nate       10     30     40     20.0     F

#### how to use apply function

In [197]:
def pass_or_fail(row):
    print(row)
    if row != "F":
        return 'Pass'
    else:
        return 'Fail'

In [198]:
df.grade = df.grade.apply(pass_or_fail)

A
B
F

In [199]:
df

    name  midterm  final  total  average grade
0   John       95     85    180     90.0  Pass
1  Jenny       85     80    165     82.5  Pass
2   Nate       10     30     40     20.0  Fail

#### info extraction using df.apply

In [200]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [201]:
def extract_year(row):
    return row.split('-')[0]

In [202]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)

In [203]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

# Add Row

In [204]:
friend_dict_list = [{'name': 'John', 'midterm': 95, 'final': 85},
         {'name': 'Jenny', 'midterm': 85, 'final': 80},
         {'name': 'Nate', 'midterm': 10, 'final': 30}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])
df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30

In [205]:
df2 = pd.DataFrame([['Ben', 50,50]], columns = ['name', 'midterm', 'final'])

In [206]:
df2.head()

  name  midterm  final
0  Ben       50     50

In [207]:
df.append(df2, ignore_index=True)

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30
3    Ben       50     50

# Group by
group by command helps to get more information from given data

In [232]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"}
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [233]:
groupby_major = df.groupby('major')

In [239]:
groupby_major.groups

{'Computer Science': Int64Index([0, 1, 6, 7], dtype='int64'),
 'Economics': Int64Index([4, 5, 9], dtype='int64'),
 'Physics': Int64Index([2], dtype='int64'),
 'Psychology': Int64Index([3, 8, 10], dtype='int64')}

here we can see, computer science has mostly man, while economic has mostly woman students

In [235]:
for name, group in groupby_major:
    print(name + ": " + str(len(group)))
    print(group)
    print()

Computer Science: 4
       name             major     sex
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male

Economics: 3
    name      major     sex
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female

Physics: 1
      name    major   sex
2  Abraham  Physics  male

Psychology: 3
     name       major     sex
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female

In [238]:
groupby_sex = df.groupby('sex')

here we can see, this school has balanced woman and man ratio

In [237]:
for name, group in groupby_sex:
    print(name + ": " + str(len(group)))
    print(group)
    print()

female: 6
        name             major     sex
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

male: 5
      name             major   sex
0     John  Computer Science  male
1     Nate  Computer Science  male
2  Abraham           Physics  male
3    Brian        Psychology  male
7   Edward  Computer Science  male

# Drop Duplicate
sometimes you need to drop duplicate rows and here is elegant way to to it

In [243]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"},
                {'name': 'John', 'major': "Computer Science", 'sex': "male"},
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female
11      John  Computer Science    male

## check if there is duplicated row

In [242]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
dtype: bool

In [246]:
df = df.drop_duplicates()

In [247]:
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [252]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Nate', 'major': None, 'sex': "male"},
                {'name': 'John', 'major': "Computer Science", 'sex': None},
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Nate              None    male
11      John  Computer Science    None

In [253]:
df.duplicated(['name'])

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
11     True
dtype: bool

In [255]:
df.drop_duplicates(['name'], keep='last')

        name             major     sex
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Nate              None    male
11      John  Computer Science    None

In [256]:
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Nate              None    male
11      John  Computer Science    None

# how to manage None value?

In [258]:
school_id_list = [{'name': 'John', 'job': "teacher", 'age': 40},
                {'name': 'Nate', 'job': "teacher", 'age': 35},
                {'name': 'Abraham', 'job': "student", 'age': 10},
                {'name': 'Brian', 'job': "student", 'age': 12},
                {'name': 'Janny', 'job': "student", 'age': 11},
                {'name': 'Yuna', 'job': "teacher", 'age': 37},
                {'name': 'Jeniffer', 'job': "student", 'age': 10},
                {'name': 'Edward', 'job': "student", 'age': 11},
                {'name': 'Zara', 'job': "student", 'age': 12},
                {'name': 'Wendy', 'job': "student", 'age': 10},
                {'name': 'Nate', 'job': "teacher", 'age': None},
                {'name': 'John', 'job': "student", 'age': None}
         ]
df = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age'])
df

        name      job   age
0       John  teacher  40.0
1       Nate  teacher  35.0
2    Abraham  student  10.0
3      Brian  student  12.0
4      Janny  student  11.0
5       Yuna  teacher  37.0
6   Jeniffer  student  10.0
7     Edward  student  11.0
8       Zara  student  12.0
9      Wendy  student  10.0
10      Nate  teacher   NaN
11      John  student   NaN